InformationRegisters/КодыТоваровSKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровSKU</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыТоваровPLUНаОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровPLUНаОборудовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодТовараSKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТовараPLU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакСпособаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Comment>Предназначен для обмена с оборудованием Offline</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КодыТоваровSKU/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет коды SKU и PLU.
//
// Параметры:
//  ТаблицаТоваров - ТаблицаЗначений - таблица товаров для обновления SKU.
//  СоздаватьSKU - Булево - признак создания SKU в процессе работы процедуры.
//  ПравилоОбмена - СправочникСсылка.ПравилаОбменаСПодключаемымОборудованием - правило обмена для обновления SKU.
//  ЗакончилисьSKU - Булево - признак закончившихся SKU.
//
Процедура ОбновитьКоды_SKU_PLU(ТаблицаТоваров, СоздаватьSKU, ПравилоОбмена = Неопределено, ЗакончилисьSKU = Ложь) Экспорт
	
	Если СоздаватьSKU Тогда
		
		РазмерыСписков = РазмерыСписковТоваров(ТаблицаТоваров);
		
		//Если НЕ РазмерыСписков.РазмерСпискаВесовыхТоваров = 0 Тогда
		//	СвободныеВесовыеSKU = СписокСвободныхВесовыхSKU(РазмерыСписков.РазмерСпискаВесовыхТоваров);
		//Иначе
			СвободныеВесовыеSKU = Новый Массив;
		//КонецЕсли;
		
		Если НЕ РазмерыСписков.РазмерСпискаШтучныхТоваров = 0 Тогда
			СвободныеШтучныеSKU = СписокСвободныхШтучныхSKU(РазмерыСписков.РазмерСпискаШтучныхТоваров);
		Иначе
			СвободныеШтучныеSKU = Новый Массив;
		КонецЕсли;
		
	КонецЕсли;
	
	PLU = ПолучитьМаксимальныйPLU(ПравилоОбмена);
	
	ОбновлятьКодыТоваровPLUНаОборудовании = Ложь;
	//СвояНумерацияPLUНаОборудовании = Ложь;
	//
	Если ЗначениеЗаполнено(ПравилоОбмена) Тогда
		ОбновлятьКодыТоваровPLUНаОборудовании = Истина;
	//	СвояНумерацияPLUНаОборудовании = ПравилоОбмена.СвояНумерацияPLUНаОборудовании;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		Если СоздаватьSKU И НЕ ЗначениеЗаполнено(СтрокаТЧ.SKU) ИЛИ СтрокаТЧ.SKU = 0 Тогда
			
			Если СтрокаТЧ.Весовой Тогда
				
				//СвободныйВесовойSKU = ПолучитьСвободныйSKU(СвободныеВесовыеSKU);
				//
				//Если СвободныйВесовойSKU = Неопределено Тогда
				//	ЗакончилисьSKU = Истина;
				//	Продолжить;
				//Иначе
				//	СтрокаТЧ.SKU = СвободныйВесовойSKU;
				//КонецЕсли;
				
			Иначе
				
				СвободныйШтучныйSKU = ПолучитьСвободныйSKU(СвободныеШтучныеSKU);
				
				Если СвободныйШтучныйSKU = Неопределено Тогда
					ЗакончилисьSKU = Истина;
					Продолжить;
				Иначе
					СтрокаТЧ.SKU = СвободныйШтучныйSKU;
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаписатьSKU(СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.ЕдиницаИзмерения, СтрокаТЧ.SKU);
			
		КонецЕсли;
		
		Если ОбновлятьКодыТоваровPLUНаОборудовании И ЗначениеЗаполнено(СтрокаТЧ.SKU) И НЕ ЗначениеЗаполнено(СтрокаТЧ.PLU) Тогда
			
		//	Если СвояНумерацияPLUНаОборудовании Тогда
		//		PLU = PLU + 1;
		//		СтрокаТЧ.PLU = PLU;
		//	Иначе
				СтрокаТЧ.PLU = СтрокаТЧ.SKU;
		//	КонецЕсли;
			
			ЗаписатьPLU(ПравилоОбмена, СтрокаТЧ.PLU, СтрокаТЧ.SKU);
			
			ЗарегистрироватьИзмененияДляОбмена(ПравилоОбмена, СтрокаТЧ.PLU);
		КонецЕсли;
		
	КонецЦикла;
	
	//Если ОбновлятьКодыТоваровPLUНаОборудовании Тогда
	//	УдалитьНеиспользуемыеКодыТоваровPLUНаОборудовании(ТаблицаТоваров, ПравилоОбмена);
	//КонецЕсли;
	
КонецПроцедуры

// Возвращает максимальный код SKU.
//
// Параметры:
//  Весовой - Булево - признак весового товара.
//  НижняяГраницаВесовогоТовара - Число - нижняя граница.
//  ВерхняяГраницаВесовогоТовара - Число - верхняя граница.
//
// Возвращаемое значение:
//  Число - максимальный код SKU.
//
Функция ПолучитьМаксимальныйКодSKU(Весовой, НижняяГраницаВесовогоТовара, ВерхняяГраницаВесовогоТовара) Экспорт
		
	Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(КодыТоваровSKU.SKU) КАК SKU
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|ГДЕ КодыТоваровSKU.SKU >= &Значение1";
	
	Если Весовой Тогда
		Текст = Текст + " И КодыТоваровSKU.SKU <= &Значение2";
		Запрос = Новый Запрос(Текст);
		Запрос.УстановитьПараметр("Значение1", НижняяГраницаВесовогоТовара);
		Запрос.УстановитьПараметр("Значение2", ВерхняяГраницаВесовогоТовара);
		Результат = НижняяГраницаВесовогоТовара;
	Иначе
		Запрос = Новый Запрос(Текст);
		Запрос.УстановитьПараметр("Значение1", ВерхняяГраницаВесовогоТовара);
		Результат = ВерхняяГраницаВесовогоТовара;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.SKU) Тогда
			Результат = Выборка.SKU + 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат; 

КонецФункции 

// Возвращаете свободные коды SKU.
//
// Параметры:
//  НижняяГраница - Число - нижняя граница кодов SKU.
//  ВерхняяГраница - Число - верхняя граница кодов SKU.
//
Функция ПолучитьСвободныеSKUМетодомОбъединения(НижняяГраница = 1, ВерхняяГраница = Неопределено) Экспорт

	Текст = "ВЫБРАТЬ
	|	КодыТоваровSKU.SKU КАК Код
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|ГДЕ
	|	КодыТоваровSKU.SKU >= &НижняяГраница
	|";
	
	Если ВерхняяГраница <> Неопределено Тогда
		Текст = Текст+"
		|	И КодыТоваровSKU.SKU <= &ВерхняяГраница";
	КонецЕсли;
	
	Текст = Текст+"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&НижняяГраница КАК Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВерхняяГраница КАК Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НижняяГраница", НижняяГраница);
	Запрос.УстановитьПараметр("ВерхняяГраница", ВерхняяГраница);
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДиапазонов = Новый ТаблицаЗначений;
	ТаблицаДиапазонов.Колонки.Добавить("НачалоИнтервала"       , Новый ОписаниеТипов("Число"));
	ТаблицаДиапазонов.Колонки.Добавить("КонецИнтервала"        , Новый ОписаниеТипов("Число"));
	ТаблицаДиапазонов.Колонки.Добавить("КоличествоСвободныхSKU", Новый ОписаниеТипов("Число"));
	ТаблицаДиапазонов.Колонки.Добавить("SKU"                   , Новый ОписаниеТипов("Число"));
	
	Если ТаблицаЗапроса.Количество() > 1 Тогда
		
		Для Итератор = 2 По ТаблицаЗапроса.Количество() Цикл
			
			СтрокаПредыдущая = ТаблицаЗапроса[Итератор - 2];
			СтрокаТекущая    = ТаблицаЗапроса[Итератор - 1];
			
			Если СтрокаТекущая.Код - СтрокаПредыдущая.Код > 1 Тогда
				
				СтрокаДиапазона = ТаблицаДиапазонов.Добавить();
				СтрокаДиапазона.НачалоИнтервала        = СтрокаПредыдущая.Код + 1;
				СтрокаДиапазона.КонецИнтервала         = СтрокаТекущая.Код - 1;
				СтрокаДиапазона.КоличествоСвободныхSKU = СтрокаДиапазона.КонецИнтервала - СтрокаДиапазона.НачалоИнтервала;
				СтрокаДиапазона.SKU                    = СтрокаДиапазона.НачалоИнтервала;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаДиапазонов;

КонецФункции 

// Проверяет свободен ли код SKU.
// 
// Параметры:
//  SKU - Число - код SKU для проверки.
// 
// Возвращаемое значение:
//  Булево - признак свободы кода.
//
Функция SKUСвободен(SKU) Экспорт
	
	Текст = "ВЫБРАТЬ
	        |	КодыТоваровSKU.SKU КАК Код
	        |ИЗ
	        |	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	        |ГДЕ
	        |	КодыТоваровSKU.SKU = &SKU";
			
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("SKU", SKU);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат НЕ Выборка.Следующий();
	
КонецФункции

// Записывает SKU.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номеклатура по которой необходимо записать SKU.
//  Характеристика - СправочникСсылка.Характеристики - характеристика по которой необходимо записать SKU.
//  Упаковка - СправочникСсылка.Упаковки - упаковка по которой необходимо записать SKU.
//  SKU - Число - код SKU товара.
//
Процедура ЗаписатьSKU(Номенклатура, Характеристика, ЕдиницаИзмерения, SKU) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.КодыТоваровSKU.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.SKU = SKU;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Номенклатура   	= Номенклатура;
		МенеджерЗаписи.ЕдиницаИзмерения = ЕдиницаИзмерения;
		МенеджерЗаписи.Характеристика 	= Характеристика;
		МенеджерЗаписи.Записать();
	Иначе
		МенеджерЗаписи = РегистрыСведений.КодыТоваровSKU.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура   	= Номенклатура;
		МенеджерЗаписи.ЕдиницаИзмерения = ЕдиницаИзмерения;
		МенеджерЗаписи.Характеристика 	= Характеристика;
		МенеджерЗаписи.SKU            	= SKU;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Удаляет SKU.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номеклатура по которой необходимо удалить SKU.
//  Характеристика - СправочникСсылка.Характеристики - характеристика по которой необходимо удалить SKU.
//  Упаковка - СправочникСсылка.Упаковки - упаковка по которой необходимо удалить SKU.
//  SKU - Число - код SKU товара.
//
Процедура УдалитьSKU(Номенклатура, Характеристика, Упаковка, SKU) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.КодыТоваровSKU.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура   = Номенклатура;
	МенеджерЗаписи.Характеристика = Характеристика;
	МенеджерЗаписи.Упаковка       = Упаковка;
	МенеджерЗаписи.SKU            = SKU;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
 КонецПроцедуры

// Создает SKU.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номеклатура по которой необходимо создать SKU.
//  ЗакончилисьSKU - Булево - признак свободных SKU.
Процедура СоздатьSKU(Номенклатура, ЗакончилисьSKU = Ложь) Экспорт
	
	ТаблицаНоменклатурныхПозиций = ПолучитьРазрезыБезSKU(Номенклатура);
	
	ОбновитьКоды_SKU_PLU(ТаблицаНоменклатурныхПозиций, Истина, , ЗакончилисьSKU);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьPLU(ПравилоОбмена, КодТовараPLU, КодТовараSKU)
	
	МенеджерЗаписи = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПравилоОбмена = ПравилоОбмена;
	МенеджерЗаписи.КодТовараPLU = КодТовараPLU;
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьМенеджерЗаписи();
	КонецЕсли;
	
	МенеджерЗаписи.ПравилоОбмена = ПравилоОбмена;
	МенеджерЗаписи.КодТовараPLU  = КодТовараPLU;
	МенеджерЗаписи.КодТовараSKU  = КодТовараSKU;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияДляОбмена(ПравилоОбмена, PLU)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.ПравилоОбмена = &ПравилоОбмена";
	
	Запрос.УстановитьПараметр("ПравилоОбмена", ПравилоОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Набор = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		Набор.Отбор.ПравилоОбмена.Значение = ПравилоОбмена;
		Набор.Отбор.ПравилоОбмена.Использование = Истина;
		
		Набор.Отбор.КодТовараPLU.Значение = PLU;
		Набор.Отбор.КодТовараPLU.Использование = Истина;
		
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.УзелИнформационнойБазы, Набор);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНеиспользуемыеКодыТоваровPLUНаОборудовании(ТаблицаТоваров, ПравилоОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.SKU
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
	|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
	|	КодыТоваровPLUНаОборудовании.КодТовараSKU
	|ИЗ
	|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = ТаблицаТоваров.SKU
	|ГДЕ
	|	КодыТоваровPLUНаОборудовании.ПравилоОбмена = &ПравилоОбмена
	|	И ТаблицаТоваров.SKU ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ПравилоОбмена",  ПравилоОбмена);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМаксимальныйPLU(ПравилоОбмена)
	
	Если ПравилоОбмена = Неопределено Тогда
		
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(КодыТоваровPLUНаОборудовании.КодТовараPLU), 0) КАК КодТовараPLU
	|ИЗ
	|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
	|ГДЕ
	|	КодыТоваровPLUНаОборудовании.ПравилоОбмена = &ПравилоОбмена");
	
	Запрос.УстановитьПараметр("ПравилоОбмена", ПравилоОбмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.КодТовараPLU;
	Иначе
		
		Возврат 0;
	КонецЕсли;
	
КонецФункции

//Функция СписокСвободныхВесовыхSKU(РазмерСписка)
//	
//	НижняяГраница  = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("НижняяГраницаДиапазонаSKU");
//	ВерхняяГраница = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВерхняяГраницаДиапазонаSKU");
//	
//	МассивДоступныхSKU = СписокСвободныхSKUВДиапазоне(НижняяГраница, ВерхняяГраница, РазмерСписка);
//	
//	Возврат МассивДоступныхSKU;
//	
//КонецФункции

Функция СписокСвободныхШтучныхSKU(РазмерСписка)
	
	ПоправкаНаВключительно = 1;
	МаксимальноВозможныйSKU = 999999999;
	
	НижняяГраница  = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВерхняяГраницаДиапазонаSKU") + ПоправкаНаВключительно;
	ВерхняяГраница = МаксимальноВозможныйSKU;
	
	МассивДоступныхSKU = СписокСвободныхSKUВДиапазоне(НижняяГраница, ВерхняяГраница, РазмерСписка);
	
	Возврат МассивДоступныхSKU;
	
КонецФункции

Функция СписокСвободныхSKUВДиапазоне(НижняяГраница, ВерхняяГраница, РазмерСписка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(КодыТоваровSKU.SKU) КАК МинЗанятыйSKU,
	|	МАКСИМУМ(КодыТоваровSKU.SKU) КАК МаксЗанятыйSKU
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|ГДЕ
	|	КодыТоваровSKU.SKU >= &НижняяГраница
	|	И КодыТоваровSKU.SKU <= &ВерхняяГраница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(КодыТоваровSKU.SKU) КАК КоличествоSKU
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|ГДЕ
	|	КодыТоваровSKU.SKU >= &НижняяГраница
	|	И КодыТоваровSKU.SKU <= &ВерхняяГраница";
	
	Запрос.УстановитьПараметр("НижняяГраница",  НижняяГраница);
	Запрос.УстановитьПараметр("ВерхняяГраница", ВерхняяГраница);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса  = РезультатПакет[0];
	РезультатЗапроса1 = РезультатПакет[1];
	
	Выборка1 = РезультатЗапроса1.Выбрать();
	Выборка1.Следующий();
	КоличествоЗанятыхSKU = Выборка1.КоличествоSKU;
	
	Если КоличествоЗанятыхSKU = 0 Тогда
		
		НачалоДиапазонаПоиска = НижняяГраница;
		КонецДиапазонаПоиска  = НачалоДиапазонаПоиска + РазмерСписка - 1;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		МинимальныйЗанятыйSKU  = Выборка.МинЗанятыйSKU;
		МаксимальныйЗанятыйSKU = Выборка.МаксЗанятыйSKU;
		
		КоличествоПробельныхSKU = (МаксимальныйЗанятыйSKU - НижняяГраница + 1) - КоличествоЗанятыхSKU; // количество свободных SKU от нижней границы до последнего занятого SKU
		
		Если КоличествоПробельныхSKU = 0 Тогда // пробелов нет
			
			НачалоДиапазонаПоиска = МаксимальныйЗанятыйSKU + 1;
			КонецДиапазонаПоиска  = МаксимальныйЗанятыйSKU + РазмерСписка;
			
		Иначе
			
			НачалоДиапазонаПоиска = НижняяГраница;
			
			Если КоличествоПробельныхSKU > РазмерСписка Тогда
				
				КонецДиапазонаПоиска = МаксимальныйЗанятыйSKU;
			Иначе
				
				КонецДиапазонаПоиска = МаксимальныйЗанятыйSKU + РазмерСписка - КоличествоПробельныхSKU;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КонецДиапазонаПоиска = ?(КонецДиапазонаПоиска > ВерхняяГраница, ВерхняяГраница, КонецДиапазонаПоиска);
	
	МассивДоступныхSKU = СоздатьМассивДоступныхSKU(НачалоДиапазонаПоиска, КонецДиапазонаПоиска, РазмерСписка);
	
	Возврат МассивДоступныхSKU;
	
КонецФункции

Функция СоздатьМассивДоступныхSKU(НачалоДиапазона, КонецДиапазона, РазмерСписка)
	
	ТаблицаSKU = Новый ТаблицаЗначений;
	ТаблицаSKU.Колонки.Добавить("SKU", Новый ОписаниеТипов("Число"));
	
	КодSKU = НачалоДиапазона;
	
	Пока НЕ КодSKU > КонецДиапазона Цикл
		
		НоваяСтрока = ТаблицаSKU.Добавить();
		НоваяСтрока.SKU = КодSKU;
		
		КодSKU = КодSKU + 1;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаSKU", ТаблицаSKU);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаSKU.SKU КАК SKU
	|ПОМЕСТИТЬ ТаблицаSKU
	|ИЗ
	|	&ТаблицаSKU КАК ТаблицаSKU
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ %УсловиеПервые%
	|	ТаблицаSKU.SKU КАК SKU,
	|	КодыТоваровSKU.SKU КАК ЗанятыйSKU
	|ИЗ
	|	ТаблицаSKU КАК ТаблицаSKU
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ПО ТаблицаSKU.SKU = КодыТоваровSKU.SKU
	|ГДЕ
	|	КодыТоваровSKU.SKU ЕСТЬ NULL";
	
	Если РазмерСписка = 0 Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%УсловиеПервые%", "");
	Иначе
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%УсловиеПервые%", "ПЕРВЫЕ " + Формат(РазмерСписка, "ЧГ=0"));
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	МассивSKU = Результат.Выгрузить().ВыгрузитьКолонку("SKU");
	
	Возврат МассивSKU;
	
КонецФункции

Функция РазмерыСписковТоваров(ТаблицаТоваров)
	
	РазмерыСписков = Новый Структура;
	РазмерыСписков.Вставить("РазмерСпискаВесовыхТоваров", 0);
	РазмерыСписков.Вставить("РазмерСпискаШтучныхТоваров", 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ПустоеЗначение", 0);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	//|	Товары.Весовой КАК Весовой,
	|	Ложь КАК Весовой,
	|	Товары.SKU КАК SKU
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Товары.Весовой
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Весовой,
	|	Товары.SKU КАК SKU,
	|	ВЫБОР
	|		КОГДА Товары.Весовой
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Штучный
	|ПОМЕСТИТЬ ВыбранныеТовары
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.SKU = &ПустоеЗначение ИЛИ Товары.SKU ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВыбранныеТовары.Весовой), 0) КАК КоличествоВесовыхТоваров,
	|	ЕСТЬNULL(СУММА(ВыбранныеТовары.Штучный), 0) КАК КоличествоШтучныйТоваров
	|ИЗ
	|	ВыбранныеТовары КАК ВыбранныеТовары";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РазмерыСписков.РазмерСпискаВесовыхТоваров = Выборка.КоличествоВесовыхТоваров;
		РазмерыСписков.РазмерСпискаШтучныхТоваров = Выборка.КоличествоШтучныйТоваров;
	КонецЕсли;
	
	Возврат РазмерыСписков;
	
КонецФункции

Функция ПолучитьСвободныйSKU(СвободныеSKU)
	
	Если СвободныеSKU.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		СвободныйSKU = СвободныеSKU[0];
		СвободныеSKU.Удалить(0);
		
		Возврат СвободныйSKU;
	КонецЕсли;
	
КонецФункции

// Функция возвращает разрезы Номенклатура - Характеристика - Упаковка
// для которых не заполнено SKU в регистре сведений коды товаров SKU.
Функция ПолучитьРазрезыБезSKU(Номенклатура)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|ИсходныеДанные.Номенклатура,
		|ИсходныеДанные.Упаковка,
		|ИсходныеДанные.Характеристика,
		|ИсходныеДанные.Номенклатура.Весовой КАК Весовой,
		|0 КАК SKU,
		|0 КАК PLU
		|ИЗ
		|(ВЫБРАТЬ
		|	ПодЗапрос.Номенклатура КАК Номенклатура,
		|	ПодЗапрос.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ПодЗапрос.НаборУпаковок КАК НаборУпаковок,
		|	ПодЗапрос.Характеристика КАК Характеристика,
		|	Упаковки.Упаковка КАК Упаковка
		|ИЗ
		|	(ВЫБРАТЬ
		|		Номенклатура.Ссылка КАК Номенклатура,
		|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|		Номенклатура.НаборУпаковок КАК НаборУпаковок,
		|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
		|	ИЗ
		|		Справочник.Номенклатура КАК Номенклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|			ПО (ВидыНоменклатуры.Ссылка = Номенклатура.ВидНоменклатуры)
		|	ГДЕ
		|		(НЕ Номенклатура.ЭтоГруппа)
		|		И ВидыНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать)
		|		И (&ВсеТовары
		|				ИЛИ Номенклатура.Ссылка В (&Ссылка))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Номенклатура.Ссылка,
		|		Номенклатура.ВидНоменклатуры,
		|		Номенклатура.НаборУпаковок,
		|		ХарактеристикиНоменклатуры.Ссылка
		|	ИЗ
		|		Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|			ПО (Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|			ПО (ВидыНоменклатуры.Ссылка = Номенклатура.ВидНоменклатуры)
		|	ГДЕ
		|		(НЕ Номенклатура.ЭтоГруппа)
		|		И ВидыНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры)
		|		И (&ВсеТовары
		|				ИЛИ Номенклатура.Ссылка В (&Ссылка))
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		Номенклатура.Ссылка,
		|		Номенклатура.ВидНоменклатуры,
		|		Номенклатура.НаборУпаковок,
		|		ХарактеристикиНоменклатуры.Ссылка
		|	ИЗ
		|		Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|			ПО (Номенклатура.ВидНоменклатуры = ХарактеристикиНоменклатуры.Владелец)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|			ПО (ВидыНоменклатуры.Ссылка = ХарактеристикиНоменклатуры.Владелец)
		|	ГДЕ
		|		(НЕ Номенклатура.ЭтоГруппа)
		|		И ВидыНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ОбщиеДляВидаНоменклатуры)
		|		И (&ВсеТовары
		|				ИЛИ Номенклатура.Ссылка В (&Ссылка))) КАК ПодЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЕСТЬNULL(СпрУпаковки.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК Упаковка,
		|			СпрНоменклатура.Ссылка КАК Номенклатура
		|		ИЗ
		|			Справочник.Номенклатура КАК СпрНоменклатура
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК СпрУпаковки
		|				ПО (СпрУпаковки.Владелец = ВЫБОР
		|						КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|							ТОГДА СпрНоменклатура.Ссылка
		|						КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
		|							ТОГДА СпрНоменклатура.НаборУпаковок
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ)
		|		ГДЕ
		|			(НЕ СпрНоменклатура.ЭтоГруппа)
		|			И (&ВсеТовары
		|					ИЛИ СпрНоменклатура.Ссылка В (&Ссылка))
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка),
		|			СпрНоменклатура.Ссылка
		|		ИЗ
		|			Справочник.Номенклатура КАК СпрНоменклатура
		|		ГДЕ
		|			(НЕ СпрНоменклатура.ЭтоГруппа)
		|			И (&ВсеТовары
		|					ИЛИ СпрНоменклатура.Ссылка В (&Ссылка))) КАК Упаковки
		|		ПО ПодЗапрос.Номенклатура = Упаковки.Номенклатура) КАК ИсходныеДанные
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|	ПО ИсходныеДанные.Номенклатура = КодыТоваровSKU.Номенклатура
		|		И ИсходныеДанные.Характеристика = КодыТоваровSKU.Характеристика
		|		И ИсходныеДанные.Упаковка = КодыТоваровSKU.Упаковка
		|ГДЕ  
		|КодыТоваровSKU.SKU ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("ВсеТовары", Номенклатура = Неопределено);
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
